In [64]:
import os
import numpy
import json
import pandas as pd
import mysql.connector
import pymongo
from sqlalchemy import create_engine

In [65]:
host_name = "localhost"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

src_dbname = "sakila"
dst_dbname = "sakila_src"

In [66]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
mysql_hostname = "localhost"

atlas_cluster_name = "cluster0.m0hmuwa"
atlas_user_name = "meganvanderwiele"
atlas_password = "Tigers11"

conn_str_mongo = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname_mongo = "sakila_src"
dst_dbname = "sakila_rentals"

print(f"Local Connection String: {conn_str_mongo['local']}")
print(f"Atlas Connection String: {conn_str_mongo['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://meganvanderwiele:Tigers11@cluster0.m0hmuwa.mongodb.net

In [67]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str_sql = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str_sql, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str_sql = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str_sql, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [68]:
conn_str_sql = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str_sql, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

In [69]:
client = pymongo.MongoClient(conn_str_mongo["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"rentals" : 'sakila_rentals.json'}

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")
        
client.close()

In [70]:
query = {} # Select all elements (columns), and all documents (rows).
collection = "rentals"

df_rentals = get_mongo_dataframe(conn_str_mongo['atlas'], src_dbname, collection, query)  # Specify 'atlas', or 'local'
df_rentals.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1002,2005-05-31 00:47:56,709,397,2005-06-06 19:51:56,1,2006-02-15 21:30:53
1,1003,2005-05-31 00:48:20,133,161,2005-06-02 04:53:20,2,2006-02-15 21:30:53

In [71]:
##extract data from csv files

df_customers = pd.read_csv("sakila_customers.csv")
df_products = pd.read_csv("sakila_films.csv")

In [72]:
df_customers.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [73]:
df_products.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [74]:
#extract dim date table from SQL
sql_dim_date = "SELECT date_key, full_date FROM sakila.dim_date;"
df_dim_date = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_dim_date)
df_dim_date.full_date = df_dim_date.full_date.astype('datetime64')
df_dim_date.head(2)

   date_key  full_date
0  20000101 2000-01-01
1  20000102 2000-01-02

In [75]:
df_rentals.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id', 'last_update'],
      dtype='object')

In [76]:
#transformations

df_rentals = df_rentals.rename(columns = {"rental_id" : "rental_key", "inventory_id" : "inventory_key", "customer_id" : "customer_key"})
df_rentals["last_update"] = df_rentals["last_update"].astype('datetime64')
df_rentals["return_date"] = df_rentals["return_date"].astype('datetime64')

df_rentals.insert(0, "fact_order_key", range(1,df_rentals.shape[0]+1))

In [77]:
df_rentals.head(2)

,fact_order_key,rental_key,rental_date,inventory_key,customer_key,return_date,staff_id,last_update
0,1,1002,2005-05-31 00:47:56,709,397,2005-06-06 19:51:56,1,2006-02-15 21:30:53
1,2,1003,2005-05-31 00:48:20,133,161,2005-06-02 04:53:20,2,2006-02-15 21:30:53

In [78]:
df_products.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [79]:
df_products = df_products.rename(columns = {"film_id" : "film_key"})
df_products.drop(["description", "language_id", "original_language_id", "length", "rating", "special_features"], axis = 1, inplace = True)

df_products["last_update"] = df_products["last_update"].astype('datetime64')


df_products.head(2)

,film_key,title,release_year,rental_duration,rental_rate,replacement_cost,last_update
0,1,ACADEMY DINOSAUR,2006,6,0.99,20.99,2006-02-15 05:03:42
1,2,ACE GOLDFINGER,2006,3,4.99,12.99,2006-02-15 05:03:42

In [80]:
df_customers.columns

Index(['customer_id', 'store_id', 'first_name', 'last_name', 'email',
       'address_id', 'active', 'create_date', 'last_update'],
      dtype='object')

In [81]:
df_customers = df_customers.rename(columns ={"customer_id" : "customer_key", "store_id" : "store_key"})

df_customers.drop(["active", "email"],axis=1, inplace=True)

reordered_customers = ["customer_key", "store_key", "first_name", "last_name", "address_id", "create_date", "last_update"]
df_customers = df_customers[reordered_customers]

df_customers.head(2)

,customer_key,store_key,first_name,last_name,address_id,create_date,last_update
0,1,1,MARY,SMITH,5,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,6,2006-02-14 22:04:36,2006-02-15 04:57:20

In [82]:
db_operation = "insert"

tables = [('dim_customers', df_customers, 'customer_key'),
          ('dim_products', df_products, 'film_key'),
         ('fact_orders', df_rentals, 'fact_order_key'),
         ('dim_date', df_dim_date, 'date_key')]

for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [86]:
dataframe = df_products
table_name = 'products'
primary_key = 'film_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [87]:
dataframe = df_customers
table_name = 'customers'
primary_key = 'customer_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [89]:
dataframe = df_rentals
table_name = 'orders'
primary_key = 'fact_order_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [90]:
sql_purchase_orders = "SELECT * FROM sakila_rentals.fact_orders;"
df_fact_orders = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_hostname, dst_dbname, sql_purchase_orders)
df_fact_orders.head(2)

,fact_order_key,rental_key,rental_date,inventory_key,customer_key,return_date,staff_id,last_update
0,1,1002,2005-05-31 00:47:56,709,397,2005-06-06 19:51:56,1,2006-02-15 21:30:53
1,2,1003,2005-05-31 00:48:20,133,161,2005-06-02 04:53:20,2,2006-02-15 21:30:53